app/controllers/application_controller.rb

  def authentication
    decode_data = decode_user_data(request.cookies['session'])
    user_id = decode_data[0]['user_id'] if decode_data
    @current_user = User.find(user_id) if user_id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]