app/controllers/categories_controller.rb

  def index
    @categories = Category.page(params[:page])
---
SELECT  "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 10]]
SELECT COUNT(*) FROM "categories"

  def search_movies_by_category
    movies = @category.movies.page(params[:page])
---
SELECT COUNT(*) FROM "movies" INNER JOIN "categories_movies" ON "movies"."id" = "categories_movies"."movie_id" WHERE "categories_movies"."category_id" = $1  [["category_id", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "categories_movies" ON "movies"."id" = "categories_movies"."movie_id" WHERE "categories_movies"."category_id" = $1  [["category_id", 1]]

  def create
    authorize!
    category = Category.new(category_params)
    if category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Horror"], ["created_at", "2022-12-14 11:23:55.397707"], ["updated_at", "2022-12-14 11:23:55.397707"]]

  def update
    authorize! @category
    if @category.update(category_params)
---
UPDATE "categories" SET "updated_at" = $1, "name" = $2 WHERE "categories"."id" = $3  [["updated_at", "2022-12-14 11:31:31.780417"], ["name", "Horrorr"], ["id", 13]]

  def destroy
    authorize! @category
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 13]]

  def find_category
    @category = Category.find_by(id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]