app/controllers/movies_controller.rb

   def index
     @movies = Movie.page(params[:page])
---
SELECT  "movies".* FROM "movies" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "movies"

  def create
    authorize!
    category = Category.find(params[:movie][:category_id])
    @movie = Movie.new(movie_params)
    @movie.categories << category
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "movies" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "tetst"], ["description", "testestetsets"], ["created_at", "2022-12-14 12:14:38.393233"], ["updated_at", "2022-12-14 12:14:38.393233"]]

  def update
    authorize! @movie
    if @movie.update(movie_params)
---
UPDATE "movies" SET "updated_at" = $1, "title" = $2 WHERE "movies"."id" = $3  [["updated_at", "2022-12-14 12:21:26.524514"], ["title", "test"], ["id", 11]]

  def destroy
    authorize! @movie
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 11]]

  def add_category
    authorize! @movie
    find_category
    if @categories_ids.include?(params[:category_id])
      render json: { message: 'category is present' }
    elsif (category = Category.find_by(id: params[:category_id])).present?
      @movie.categories << category
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "movies" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "tetst"], ["description", "testestetsets"], ["created_at", "2022-12-14 12:14:38.393233"], ["updated_at", "2022-12-14 12:14:38.393233"]]

  def remove_category
    authorize! @movie
    find_category
    category = Category.find_by(id: params[:category_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def rate_movie
    rate = Rating.new(rating_params)
    if rate.save
---
INSERT INTO "ratings" ("user_id", "movie_id", "grade") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["movie_id", 1], ["grade", 11]]

  def find_movie
    @movie = Movie.find_by(id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def save_movie
    if @movie.save
---
INSERT INTO "movies" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "tetst"], ["description", "testestetsets"], ["created_at", "2022-12-14 12:33:43.392538"], ["updated_at", "2022-12-14 12:33:43.392538"]]

  def find_category
   @categories_ids = @movie.categories.map(&:id)
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_movies" ON "categories"."id" = "categories_movies"."category_id" WHERE "categories_movies"."movie_id" = $1  [["movie_id", 12]]