app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    user = User.new(user_params)
   if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2, "email" = $3 WHERE "users"."id" = $4  [["updated_at", "2022-12-13 19:32:59.663541"], ["username", "tesst"], ["email", "tesstttest@gmail.com"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    authorize! @user
    if @user.update(user_update_params)